benchmarking/lean_prethread_custom/benchmarking_results.txt
big-pwner@big-pwner-factory:~/Uni/Lean_Webserver/wrk-cmm$ ./wrk -t8 -c400 -d4 http://127.0.0.1:1337
Running 4s test @ http://127.0.0.1:1337
  8 threads and 400 connections
  Thread Stats   Avg     Stdev       Max       Min   +/- Stdev
    Latency    10.02ms   95.16ms    1.79s    61.00us   98.61%
    Req/Sec     0.86k   811.14      3.38k     0.00     77.36%
  10286 requests in 4.07s, 3.37MB read
Requests/sec:   2526.44
Transfer/sec:    848.73KB
big-pwner@big-pwner-factory:~/Uni/Lean_Webserver/wrk-cmm$ ./wrk -t8 -c400 -d4 http://127.0.0.1:1337
Running 4s test @ http://127.0.0.1:1337
  8 threads and 400 connections
unable to record connect
unable to record connect
unable to record connect
[...]
  Thread Stats   Avg     Stdev       Max       Min   +/- Stdev
    Latency    14.45ms  107.04ms    1.69s    60.00us   97.56%
    Req/Sec   836.76      0.91k     4.22k     2.00     84.29%
  13314 requests in 4.06s, 4.37MB read
Requests/sec:   3278.61
Transfer/sec:      1.08MB
big-pwner@big-pwner-factory:~/Uni/Lean_Webserver/wrk-cmm$ ./wrk -t8 -c400 -d4 http://127.0.0.1:1337
unable to connect to 127.0.0.1:1337 Connection refused
big-pwner@big-pwner-factory:~/Uni/Lean_Webserver/wrk-cmm$ ./wrk -t8 -c400 -d4 http://127.0.0.1:1337
Running 4s test @ http://127.0.0.1:1337
  8 threads and 400 connections
unable to record connect
unable to record connect
unable to record connect
[...]
  Thread Stats   Avg     Stdev       Max       Min   +/- Stdev
    Latency    17.12ms  129.28ms    1.85s    61.00us   97.69%
    Req/Sec     1.01k     0.94k     3.57k     0.00     71.55%
  12977 requests in 4.05s, 4.26MB read
Requests/sec:   3201.40
Transfer/sec:      1.05MB